pytrustnfe/nfse/issnet/templates/EnvelopeSoap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nfse="http://nfse.abrasf.org.br">
   <soapenv:Header/>
   <soapenv:Body>
      <nfse:RecepcionarLoteRps>
         <RecepcionarLoteRpsRequest xmlns="http://nfse.abrasf.org.br"> 
          <nfseCabecMsg><![CDATA[{% include 'cabecalho.xml' %}]]></nfseCabecMsg>
          <nfseDadosMsg><![CDATA[{% include 'RecepcionarLoteRps.xml' %}]]></nfseDadosMsg>
      </RecepcionarLoteRpsRequest>
      </nfse:RecepcionarLoteRps>
   </soapenv:Body>
</soapenv:Envelope>